#include "Tama.h"
#include <stdio.h>
#include <string>
#include <iostream>

Tama::Tama()
{
}

int Tama::Play()
{
    printf("★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆\n");
    printf("□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□\n");
    printf("□□□□□□□□□□□□□■■■□□□□□□□□□□□□□□□■■■□□□□■■■■■■■■■■■□□□□□□■■■□□□□□□■■■□□□\n");
    printf("□□□■■■■■■■■□□■■■□□□□■■■■■■■■■□□■■■□□□□■■■■■■■■■■■□□□□□□■■■□□□□□□■■■□□□\n");
    printf("□□□■■■■■■■■□□■■■□□□□■■■■■■■■■□□■■■□□□□□□□□□□□□■■■□□■■■■■■■■■■■□□■■■□□□\n");
    printf("□□□■■■□□□□□□□■■■□□□□■■■□□□■■■□□■■■□□□□□□□□□□□□■■■□□■■■■■■■■■■■□□■■■□□□\n");
    printf("□□□■■■□□□□□□□■■■■■□□■■■□□□■■■□□■■■■■□□□□□□□□□□■■■□□□□□■■■■■□□□□□■■■□□□\n");
    printf("□□□■■■□□□□□□□■■■■■□□■■■□□□■■■□□■■■■■□□□□□□□□□□■■■□□□□■■■□■■■□□□□■■■□□□\n");
    printf("□□□■■■□□□□□□□■■■■■□□■■■□□□■■■□□■■■■■□□□□□■■■□□■■■□□□■■■□□□■■■□□□■■■□□□\n");
    printf("□□□■■■□□□□□□□■■■□□□□■■■□□□■■■□□■■■□□□□□□□■■■□□■■■□□■■■□□□□□■■■□□■■■□□□\n");
    printf("□□□■■■■■■■■□□■■■□□□□■■■■■■■■■□□■■■□□□□□□□■■■□□□□□□□■■■□□□□□■■■□□■■■□□□\n");
    printf("□□□■■■■■■■■□□■■■□□□□■■■■■■■■■□□■■■□□□□■■■■■■■■■■■□□□□□□□□□□□□□□□■■■□□□\n");
    printf("□□□□□□□□□□□□□■■■□□□□□□□□□□□□□□□■■■□□□□■■■■■■■■■■■□□□□□□□□□□□□□□□■■■□□□\n");
    printf("□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□\n");
    printf("★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆\n");

    std::string StartORNo;
    std::string TamaName;
    printf("\n\n\t\t\t\t\t\t\tPlay Tamagotchi Yes or No??  ");
    std::cin >> StartORNo;

    if (StartORNo == "No" || StartORNo == "N" || StartORNo == "n" || StartORNo == "NO") {
        printf("\n\t\t\t\t\t\t\t\t다마고치를 종료합니다.\n\n");
        return 0;
    }
    else if(StartORNo == "Yes" || StartORNo == "YES" || StartORNo == "Y" || StartORNo == "y"){
        printf("이름을 지어주세요!\n");
        std::cin >> TamaName;
    }
    else {
        // 제대로 입력할때까지 - 조건문 수정하기
        while (true) {
            printf("CHOOSE ONLY YES OR NO!!!");
        }
    }

 

    printf("\t\t\t\t\t\t\t다마고치 상태 : 알\n");
    printf("\t\t\t\t\t배부름 : 100\t\t경험치 : 10 / 100\t\t 청결도 : 50\n");


}

void Tama::ShowMenu()
{
    printf("\t\t\t\t\t\t\t+----------------------+\n");
    printf("\t\t\t\t\t\t\t|      메인 메뉴       |\n");
    printf("\t\t\t\t\t\t\t+----------------------+\n");
    printf("\t\t\t\t\t\t\t|  1.밥먹기            |\n");
    printf("\t\t\t\t\t\t\t|  2.놀아주기          |\n");
    printf("\t\t\t\t\t\t\t|  3.상점              |\n");
    printf("\t\t\t\t\t\t\t|  4.목욕하기          |\n");
    printf("\t\t\t\t\t\t\t|  5.잠자기            |\n");
    //printf("\t\t\t\t\t\t\t|  6.게임종료          |\n");
    printf("\t\t\t\t\t\t\t+----------------------+\n");

}
